{
	"nav": {
		"home": "الرئيسية",
		"about": "من أنا",
		"projects": "المشاريع",
		"research": "البحث",
		"contact": "اتصل بي"
	},
	"home": {
		"title": "مرحباً بكم في ملفي الشخصي",
		"subtitle": "مهندس رياضيات وعلوم الحاسوب",
		"passion": "شغوف بالتحسين والخوارزميات المتقدمة والتحديات التقنية المعقدة",
		"terminal": {
			"commandWhoAmI": "whoami",
			"developerInfo": "دينيس شابو • مهندس رياضيات وعلوم الحاسوب • Thales",
			"commandSkills": "skills --list"
		},
		"viewProjects": "عرض المشاريع",
		"contactMe": "اتصل بي",
		"featuredProjects": "المشاريع المميزة"
	},
	"about": {
		"title": "من أنا",
		"description": "لوريم إيبسوم هو نص شكلي يُستخدم في صناعات الطباعة والتنضيد. كان النص المعياري منذ القرن الخامس عشر وما زال يُستخدم حتى الآن.",
		"experience": "الخبرة المهنية",
		"personalInfo": "الوصف",
		"education": "التعليم",
		"technologies": "التقنيات",
		"topSkills": "المهارات الرئيسية"
	},
	"projects": {
		"title": "مشاريعي",
		"description": "استكشف مشاريعي المهنية والشخصية",
		"searchPlaceholder": "البحث عن المشاريع...",
		"noResults": "لم يتم العثور على مشاريع تطابق معاييرك.",
		"clearFilters": "مسح الفلاتر",
		"viewProject": "عرض المشروع",
		"viewLiveDemo": "عرض العرض التوضيحي",
		"viewSource": "عرض الكود المصدري",
		"status": {
			"active": "نشط",
			"completed": "مكتمل",
			"in-progress": "قيد التنفيذ",
			"archived": "مؤرشف",
			"maintenance": "صيانة"
		},
		"items": [
			{
				"id": 1,
				"title": "ProChain - سلسلة إنتاج CI/CD",
				"description": "سلسلة إنتاج برمجيات معيارية جديدة لشركة Thales، تحل محل GCONF_TOOLS. هيكلية Python تتيح التجميع المتوازي والإنتاج التدريجي والاستقلالية عن Jenkins.",
				"longDescription": "خلال فترة تدريبي في Thales، قمت بتصميم وتنفيذ ProChain، وهي سلسلة إنتاج CI/CD معيارية تحل محل الحل القديم GCONF_TOOLS. تتيح هذه الهيكلية الجديدة في Python التوازي في البناء، والإدارة الدقيقة للتبعيات حسب نظام التشغيل/المعمارية، وتقلل بشكل كبير من الاعتماد على Jenkins. يتعامل النظام مع مشاريع بملايين أسطر الكود مع إمكانية التتبع ITAR ودعم متعدد المنصات (Linux، Windows). النتائج: انخفاض 20% في وقت التجميع في الوضع الكامل، وحتى 80% في وضع الدلتا."
			},
			{
				"id": 2,
				"title": "RiemannOpt - مكتبة التحسين الريماني",
				"description": "مكتبة Rust عالية الأداء للتحسين على المتشعبات الريمانية. تنفيذ خوارزميات انحدار التدرج الجيوديسي والانكماش للتعلم الآلي.",
				"longDescription": "RiemannOpt هي مكتبة تحسين مطورة بلغة Rust، متخصصة في طرق التحسين على المتشعبات الريمانية. تنفذ خوارزميات متطورة مثل انحدار التدرج الريماني وطرق الانكماش والنقل المتوازي. توفر المكتبة أداءً استثنائياً بفضل Rust وتجد تطبيقات في التعلم الآلي ورؤية الحاسوب ومعالجة الإشارات. تتضمن تحسينات لمتشعبات Grassmann و Stiefel والمصفوفات SPD."
			},
			{
				"id": 3,
				"title": "MinePP - نسخة Minecraft بلغة C++",
				"description": "محرك ألعاب الفوكسل مطور من الصفر بلغة C++ الحديثة مع OpenGL. توليد التضاريس الإجرائي ونظام chunks محسّن ومحرك فيزياء مخصص.",
				"longDescription": "MinePP هو نسخة من Minecraft مطور بالكامل بلغة C++ الحديثة (C++20)، باستخدام OpenGL للعرض ثلاثي الأبعاد. ينفذ المشروع نظام chunks مع frustum culling، وتوليد التضاريس الإجرائي عبر ضوضاء Perlin، ومحرك فيزياء مخصص مع كشف التصادم AABB، ونظام إضاءة ديناميكي. الهيكلية مصممة لتكون قابلة للتوسع مع نظام ECS (Entity Component System) وتدعم معالجة متعددة الخيوط لتوليد التضاريس."
			},
			{
				"id": 4,
				"title": "Wazuh AI Assistant - واجهة برمجة أمن سيبراني",
				"description": "واجهة برمجة REST محلية تدمج نموذج لغة كبير لتلخيص تقارير Wazuh. حل في حاويات يحترم قيود الأمان C3 مع دعم متعدد النماذج.",
				"longDescription": "مطور خلال فترة تدريبي في رومانيا في Thales، يتكون هذا المشروع من واجهة برمجة REST آمنة تتيح التحليل والتلخيص التلقائي لتقارير الأمان من Wazuh عبر نموذج لغة كبير مستضاف محلياً. الحل، المحتوى بالكامل في حاويات Docker، يدعم نماذج متعددة (TinyLlama، Qwen، Mistral 7B) ويدمج ذاكرة تخزين مؤقت Redis لتحسين الأداء. تتضمن الهيكلية PostgreSQL لإدارة الحسابات، وQdrant للبحث الشعاعي في CVEs، وNginx لإنهاء TLS. متوافق مع متطلبات الأمان C3."
			},
			{
				"id": 5,
				"title": "الملف الشخصي",
				"description": "موقع ملف شخصي حديث مطور بـ Vue 3 و TypeScript. تصميم متجاوب، حركات سلسة، دعم متعدد اللغات ووضع مظلم.",
				"longDescription": "ملف شخصي مطور بأحدث تقنيات الويب. يستخدم Vue 3 مع Composition API، وTypeScript للكتابة القوية، وPinia لإدارة الحالة. التصميم متجاوب بالكامل مع Tailwind CSS، ويتضمن حركات مخصصة ونظام مواضيع فاتح/مظلم ودعم متعدد اللغات (i18n) لـ 6 لغات. محسّن للأداء مع التحميل الكسول وتقسيم الكود."
			}
		]
	},
	"contact": {
		"title": "اتصل بي",
		"subtitle": "لا تتردد في التواصل معي لأي أسئلة، فرص تعاون، أو حتى لمجرد قول مرحبا!",
		"getInTouchTitle": "تواصل معي",
		"getInTouch": "سأعود إليك في أقرب وقت ممكن.",
		"emailLabel": "البريد الإلكتروني",
		"locationLabel": "الموقع",
		"locationValue": "باريس، فرنسا",
		"connectWithMe": "تواصل معي",
		"sendMessageTitle": "أرسل لي رسالة",
		"name": "الاسم",
		"namePlaceholder": "اسمك",
		"email": "البريد الإلكتروني",
		"emailPlaceholder": "البريد.الإلكتروني@مثال.com",
		"message": "الرسالة",
		"messagePlaceholder": "...رسالتك",
		"send": "أرسل الرسالة",
		"sending": "جاري الإرسال...",
		"messageSent": "تم إرسال الرسالة بنجاح!"
	},
	"footer": {
		"allRightsReserved": "جميع الحقوق محفوظة."
	},
	"research": {
		"title": "المنشورات والبحث",
		"description": "أعمالي البحثية ومنشوراتي الأكاديمية في التحسين وCI/CD والأمن السيبراني.",
		"searchPlaceholder": "البحث عن المنشورات...",
		"sortByDate": "ترتيب حسب التاريخ",
		"sortByCitations": "ترتيب حسب الاقتباسات",
		"allTopics": "جميع المواضيع",
		"featured": "مميز",
		"citations": "اقتباسات",
		"downloadPdf": "تحميل PDF",
		"noResults": "لم يتم العثور على منشورات."
	}
}
