{
	"nav": {
		"home": "الرئيسية",
		"about": "من أنا",
		"projects": "المشاريع",
		"research": "البحث",
		"contact": "اتصل بي"
	},
	"home": {
		"title": "مرحباً بكم في ملفي الشخصي",
		"subtitle": "مهندس رياضيات وعلوم الحاسوب",
		"passion": "شغوف بالتحسين والخوارزميات المتقدمة والتحديات التقنية المعقدة",
		"terminal": {
			"commandWhoAmI": "whoami",
			"developerInfo": "دينيس شابو • مهندس رياضيات وعلوم الحاسوب • Thales",
			"commandSkills": "skills --list"
		},
		"viewProjects": "عرض المشاريع",
		"contactMe": "اتصل بي",
		"featuredProjects": "المشاريع المميزة"
	},
	"about": {
		"title": "من أنا",
		"description": "لوريم إيبسوم هو نص شكلي يُستخدم في صناعات الطباعة والتنضيد. كان النص المعياري منذ القرن الخامس عشر وما زال يُستخدم حتى الآن.",
		"experience": "الخبرة",
		"education": "التعليم",
		"technologies": "التقنيات",
		"topSkills": "المهارات الرئيسية"
	},
	"projects": {
		"title": "مشاريعي",
		"description": "إليك بعض من أحدث مشاريعي",
		"searchPlaceholder": "البحث عن المشاريع...",
		"noResults": "لم يتم العثور على مشاريع تطابق معاييرك.",
		"clearFilters": "مسح الفلاتر",
		"viewProject": "عرض المشروع",
		"viewLiveDemo": "عرض العرض التوضيحي",
		"viewSource": "عرض الكود المصدري",
		"status": {
			"active": "نشط",
			"completed": "مكتمل",
			"in-progress": "قيد التنفيذ",
			"archived": "مؤرشف",
			"maintenance": "صيانة"
		},
		"items": [
			{
				"id": 1,
				"title": "منصة التجارة الإلكترونية",
				"description": "لوريم إيبسوم هو نص شكلي يُستخدم في صناعات الطباعة والتنضيد. كان النص المعياري منذ القرن الخامس عشر وما زال يُستخدم حتى الآن.",
				"longDescription": "لوريم إيبسوم هو نص شكلي يُستخدم في صناعات الطباعة والتنضيد. كان النص المعياري منذ القرن الخامس عشر وما زال يُستخدم حتى الآن. لقد شهدت شعبية في الستينيات من القرن الماضي مع إصدار أوراق Letraset التي تحتوي على مقاطع لوريم إيبسوم، ومؤخراً مع برامج النشر المكتبي مثل ألدوس بيج ميكر التي تتضمن إصدارات لوريم إيبسوم."
			},
			{
				"id": 2,
				"title": "لوحة معلومات وسائل التواصل الاجتماعي",
				"description": "هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص.",
				"longDescription": "هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاً طبيعياً -إلى حد ما- للأحرف."
			},
			{
				"id": 3,
				"title": "تحليلات مدعومة بالذكاء الاصطناعي",
				"description": "خلافاً للاعتقاد السائد فإن لوريم إيبسوم ليس نصاً عشوائياً، بل إن له جذور في الأدب اللاتيني الكلاسيكي منذ العام 45 قبل الميلاد.",
				"longDescription": "خلافاً للاعتقاد السائد فإن لوريم إيبسوم ليس نصاً عشوائياً، بل إن له جذور في الأدب اللاتيني الكلاسيكي منذ العام 45 قبل الميلاد، مما يجعله أكثر من 2000 عام في القدم. قام البروفيسور 'ريتشارد ماك لينتوك' وهو بروفيسور اللغة اللاتينية في جامعة هامبدن-سيدني في فيرجينيا بالبحث عن أصول كلمة لاتينية غامضة في نص لوريم إيبسوم."
			},
			{
				"id": 4,
				"title": "تطبيق اللياقة البدنية للجوال",
				"description": "وعند موافقته على الطلب، فخالق سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات.",
				"longDescription": "ومن هنا وجب على المصمم أن يضع نصوصاً مؤقتة على التصميم ليظهر للعميل الشكل كاملاً، دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ."
			},
			{
				"id": 5,
				"title": "منصة إنترنت الأشياء للمنزل الذكي",
				"description": "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى.",
				"longDescription": "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق، إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى."
			},
			{
				"id": 6,
				"title": "محفظة بلوكتشين",
				"description": "النص لا يبدو مقسما ولا يحوي كلمات من اللغة الانجليزية، مولد النص العربى مفيد لمصممي المواقع.",
				"longDescription": "النص لا يبدو مقسما ولا يحوي كلمات من اللغة الانجليزية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع."
			}
		]
	},
	"contact": {
		"title": "اتصل بي",
		"subtitle": "لا تتردد في التواصل معي لأي أسئلة، فرص تعاون، أو حتى لمجرد قول مرحبا!",
		"getInTouch": "سأعود إليك في أقرب وقت ممكن.",
		"name": "الاسم",
		"email": "البريد الإلكتروني",
		"message": "الرسالة",
		"send": "أرسل الرسالة",
		"messageSent": "تم إرسال الرسالة بنجاح!"
	},
	"footer": {
		"allRightsReserved": "جميع الحقوق محفوظة."
	},
	"research": {
		"title": "المنشورات والبحث",
		"description": "أعمالي البحثية ومنشوراتي الأكاديمية في التحسين وCI/CD والأمن السيبراني.",
		"searchPlaceholder": "البحث عن المنشورات...",
		"sortByDate": "ترتيب حسب التاريخ",
		"sortByCitations": "ترتيب حسب الاقتباسات",
		"allTopics": "جميع المواضيع",
		"featured": "مميز",
		"citations": "اقتباسات",
		"downloadPdf": "تحميل PDF",
		"noResults": "لم يتم العثور على منشورات."
	}
}
