{
	"nav": {
		"home": "Startseite",
		"about": "Über mich",
		"projects": "Projekte",
		"research": "Forschung",
		"contact": "Kontakt"
	},
	"home": {
		"title": "Willkommen in meinem Portfolio",
		"subtitle": "Ingenieur für Mathematik und Informatik",
		"passion": "Spezialisiert auf mathematische Optimierung, künstliche Intelligenz und die Entwicklung innovativer Lösungen.",
		"terminal": {
			"commandWhoAmI": "whoami",
			"developerInfo": "Denis Chaput • Ingenieur für Mathematik und Informatik • Thales",
			"commandSkills": "skills --list"
		},
		"viewProjects": "Projekte ansehen",
		"contactMe": "Kontaktiere mich",
		"featuredProjects": "Hervorgehobene Projekte"
	},
	"about": {
		"title": "Über mich",
		"description": "Absolvent Ingenieur leidenschaftlich über Mathematik, Informatik und das Lösen komplexer Herausforderungen.",
		"experience": "Berufserfahrung",
		"personalInfo": "Beschreibung",
		"profile": "Profil",
		"currentPosition": "Aktuelle Position",
		"location": "Standort",
		"education": "Ausbildung",
		"technologies": "Technologien",
		"programmingLanguages": "Programmiersprachen",
		"skillLevels": {
			"expert": "Experte",
			"advanced": "Fortgeschritten",
			"intermediate": "Mittel",
			"beginner": "Grundkenntnisse"
		},
		"educationItems": [
			{
				"institution": "Polytech Paris-Saclay",
				"degree": "Ingenieurstudium - Informatik und Mathematische Ingenieurwissenschaften",
				"period": "2022 - 2025",
				"description": "Informatik und Mathematische Ingenieurwissenschaften. Duales Studium bei Thales."
			},
			{
				"institution": "Selbststudium",
				"degree": "Angewandte Mathematik & Künstliche Intelligenz",
				"period": "2023 - 2025",
				"description": "Tiefgreifende autodidaktische Ausbildung in angewandter Mathematik, maschinellem Lernen und künstlicher Intelligenz."
			}
		],
		"experienceItems": [
			{
				"company": "Thales Land & Air Systems",
				"role": "CI/CD Entwicklungsingenieur Auszubildender",
				"period": "Sept 2023 - Aug 2025",
				"description": "Entwurf und Implementierung einer neuen modularen Software-Produktionskette, die die veraltete Lösung zur Verwaltung von Multi-Millionen-Zeilen-Projekten ersetzt."
			},
			{
				"company": "Thales Romania",
				"role": "Cybersicherheit-Entwickler Praktikant",
				"period": "Juni 2025 - Aug 2025",
				"description": "Entwicklung einer lokalen REST-API, die ein LLM für die automatische Analyse von Sicherheitsberichten integriert, konform mit C3-Anforderungen."
			}
		]
	},
	"projects": {
		"title": "Meine Projekte",
		"description": "Entdecken Sie meine beruflichen und persönlichen Projekte",
		"searchPlaceholder": "Projekte suchen...",
		"noResults": "Keine Projekte gefunden, die Ihren Kriterien entsprechen.",
		"clearFilters": "Filter löschen",
		"viewProject": "Projekt ansehen",
		"viewLiveDemo": "Live-Demo ansehen",
		"viewSource": "Quellcode ansehen",
		"status": {
			"active": "Aktiv",
			"completed": "Abgeschlossen",
			"in-progress": "In Bearbeitung",
			"archived": "Archiviert",
			"maintenance": "Wartung"
		},
		"items": [
			{
				"id": 1,
				"title": "Modulare CI/CD-Produktionskette",
				"description": "Neue modulare Software-Produktionskette, die die veraltete Lösung ersetzt. Python-Architektur ermöglicht parallele Kompilierung, inkrementelle Produktion und verbesserte Autonomie von CI-Tools.",
				"longDescription": "Während meiner Ausbildung bei Thales habe ich eine modulare CI/CD-Produktionskette entworfen und implementiert, die die veraltete Lösung ersetzt. Diese neue Python-Architektur ermöglicht Build-Parallelisierung, optimierte Abhängigkeitsverwaltung pro OS/Architektur und verbessert die Autonomie von Continuous-Integration-Tools. Das System verwaltet große Projekte mit vollständiger Nachverfolgbarkeit und Multi-Platform-Support. Ergebnisse: signifikante Verbesserung der Kompilierungszeiten mit Gewinnen von 20% bis 80% je nach Ausführungsmodus."
			},
			{
				"id": 2,
				"title": "RiemannOpt - Riemannsche Optimierungsbibliothek",
				"description": "Hochperformante Rust-Bibliothek für die Optimierung auf Riemannschen Mannigfaltigkeiten. Implementierung geodätischer Gradientenabstieg und Retraktionsalgorithmen für maschinelles Lernen.",
				"longDescription": "RiemannOpt ist eine in Rust entwickelte Optimierungsbibliothek, spezialisiert auf Optimierungsverfahren auf Riemannschen Mannigfaltigkeiten. Sie implementiert hochmoderne Algorithmen wie Riemannschen Gradientenabstieg, Retraktionsverfahren und Paralleltransport. Die Bibliothek bietet außergewöhnliche Performance dank Rust und findet Anwendung in maschinellem Lernen, Computer Vision und Signalverarbeitung. Sie enthält Optimierungen für Grassmann- und Stiefel-Mannigfaltigkeiten sowie SPD-Matrizen."
			},
			{
				"id": 3,
				"title": "MinePP - Minecraft-Klon in C++",
				"description": "Voxel-Spielengine von Grund auf in modernem C++ mit OpenGL entwickelt. Prozedurale Geländegenerierung, optimiertes Chunk-System und benutzerdefinierte Physik-Engine.",
				"longDescription": "MinePP ist ein Minecraft-Klon, der vollständig in modernem C++ (C++20) entwickelt wurde und OpenGL für 3D-Rendering verwendet. Das Projekt implementiert ein Chunk-System mit Frustum-Culling, prozedurale Geländegenerierung via Perlin-Rauschen, eine benutzerdefinierte Physik-Engine mit AABB-Kollisionserkennung und ein dynamisches Beleuchtungssystem. Die Architektur ist erweiterbar mit einem ECS (Entity Component System) und unterstützt Multithreading für die Geländegenerierung."
			},
			{
				"id": 4,
				"title": "Wazuh AI Assistant - Cybersicherheits-API",
				"description": "On-Premise REST-API, die ein LLM zur Synthese von Wazuh-Berichten integriert. Containerisierte Lösung, die C3-Sicherheitsbeschränkungen erfüllt und Multi-Modell-Support bietet.",
				"longDescription": "Während meines Praktikums in Rumänien bei Thales entwickelt, besteht dieses Projekt aus einer sicheren REST-API, die automatische Analyse und Synthese von Wazuh-Sicherheitsberichten über ein lokal gehostetes LLM ermöglicht. Die vollständig mit Docker containerisierte Lösung unterstützt mehrere Modelle (TinyLlama, Qwen, Mistral 7B) und integriert Redis-Cache für Performance-Optimierung. Die Architektur umfasst PostgreSQL für Kontoverwaltung, Qdrant für Vektorsuche in CVEs und Nginx für TLS-Terminierung. Konform mit C3-Sicherheitsanforderungen."
			},
			{
				"id": 5,
				"title": "Persönliches Portfolio",
				"description": "Moderne Portfolio-Website entwickelt mit Vue 3 und TypeScript. Responsives Design, flüssige Animationen und mehrsprachiger Support.",
				"longDescription": "Persönliches Portfolio entwickelt mit den neuesten Webtechnologien. Verwendet Vue 3 mit Composition API, TypeScript für starke Typisierung und Pinia für Zustandsverwaltung. Das Design ist vollständig responsiv mit Tailwind CSS, enthält benutzerdefinierte Animationen und mehrsprachigen Support (i18n) für 6 Sprachen. Optimiert für Performance mit Lazy Loading und Code Splitting."
			}
		]
	},
	"contact": {
		"title": "Kontaktiere mich",
		"subtitle": "Zögere nicht, mich bei Fragen, Kooperationsmöglichkeiten oder einfach nur zum Hallo sagen zu kontaktieren!",
		"getInTouchTitle": "Kontakt aufnehmen",
		"getInTouch": "Ich werde mich so schnell wie möglich bei dir melden.",
		"emailLabel": "E-Mail",
		"locationLabel": "Standort",
		"locationValue": "Paris, Frankreich",
		"connectWithMe": "Vernetze dich mit mir",
		"sendMessageTitle": "Schreib mir eine Nachricht",
		"name": "Name",
		"namePlaceholder": "Dein Name",
		"email": "E-Mail",
		"emailPlaceholder": "deine.email{'@'}beispiel.com",
		"message": "Nachricht",
		"messagePlaceholder": "Deine Nachricht...",
		"send": "Nachricht senden",
		"sending": "Wird gesendet...",
		"messageSent": "Nachricht erfolgreich gesendet!"
	},
	"footer": {
		"allRightsReserved": "Alle Rechte vorbehalten."
	},
	"research": {
		"title": "Veröffentlichungen & Forschung",
		"description": "Meine unabhängigen Forschungsarbeiten (und zukünftige akademische Veröffentlichungen).",
		"searchPlaceholder": "Publikationen suchen...",
		"sortByDate": "Nach Datum sortieren",
		"sortByCitations": "Nach Zitaten sortieren",
		"allTopics": "Alle Themen",
		"featured": "Hervorgehoben",
		"citations": "Zitate",
		"downloadPdf": "PDF herunterladen",
		"noResults": "Keine Veröffentlichungen gefunden.",
		"notAvailableTitle": "Veröffentlichungen demnächst",
		"notAvailableMessage": "Forschungsarbeiten sind noch nicht verfügbar. Sie werden in Kürze veröffentlicht.",
		"papers": []
	}
}
