{
	"nav": {
		"home": "Home",
		"about": "About",
		"projects": "Projects",
		"research": "Research",
		"contact": "Contact"
	},
	"home": {
		"title": "Welcome to My Portfolio",
		"subtitle": "Mathematics and Computer Science Engineer",
		"passion": "Passionate about optimization, advanced algorithms and complex technical challenges",
		"terminal": {
			"commandWhoAmI": "whoami",
			"developerInfo": "Denis Chaput • Mathematics and Computer Science Engineer • Thales",
			"commandSkills": "skills --list"
		},
		"viewProjects": "View Projects",
		"contactMe": "Contact Me",
		"featuredProjects": "Featured Projects"
	},
	"about": {
		"title": "About Me",
		"description": "Engineering apprentice at Thales, specialized in CI/CD systems and software production chain optimization. Passionate about cutting-edge technologies, performance optimization, and complex technical challenges.",
		"experience": "Professional Experience",
		"personalInfo": "Description",
		"education": "Education",
		"technologies": "Technologies",
		"topSkills": "Top Skills"
	},
	"projects": {
		"title": "My Projects",
		"description": "Explore my professional and personal projects",
		"searchPlaceholder": "Search projects...",
		"noResults": "No projects found matching your criteria.",
		"clearFilters": "Clear Filters",
		"viewProject": "View Project",
		"viewLiveDemo": "View Live Demo",
		"viewSource": "View Source",
		"status": {
			"active": "Active",
			"completed": "Completed",
			"in-progress": "In Progress",
			"archived": "Archived",
			"maintenance": "Maintenance"
		},
		"items": [
			{
				"id": 1,
				"title": "ProChain - CI/CD Production Chain",
				"description": "New modular software production chain for Thales, replacing GCONF_TOOLS. Python architecture enabling parallel compilation, incremental production, and independence from Jenkins.",
				"longDescription": "During my apprenticeship at Thales, I designed and implemented ProChain, a modular CI/CD production chain replacing the legacy GCONF_TOOLS solution. This new Python architecture enables build parallelization, fine-grained dependency management per OS/architecture, and drastically reduces Jenkins dependency. The system handles multi-million line codebases with ITAR traceability and multi-platform support (Linux, Windows). Results: 20% reduction in full compilation time, and up to 80% in delta mode."
			},
			{
				"id": 2,
				"title": "RiemannOpt - Riemannian Optimization Library",
				"description": "High-performance Rust library for optimization on Riemannian manifolds. Implementation of geodesic gradient descent and retraction algorithms for machine learning.",
				"longDescription": "RiemannOpt is an optimization library developed in Rust, specialized in optimization methods on Riemannian manifolds. It implements state-of-the-art algorithms like Riemannian gradient descent, retraction methods, and parallel transport. The library offers exceptional performance thanks to Rust and finds applications in machine learning, computer vision, and signal processing. It includes optimizations for Grassmann and Stiefel manifolds, and SPD matrices."
			},
			{
				"id": 3,
				"title": "MinePP - Minecraft Clone in C++",
				"description": "Voxel game engine developed from scratch in modern C++ with OpenGL. Procedural terrain generation, optimized chunk system, and custom physics engine.",
				"longDescription": "MinePP is a Minecraft clone developed entirely in modern C++ (C++20), using OpenGL for 3D rendering. The project implements a chunk system with frustum culling, procedural terrain generation via Perlin noise, custom physics engine with AABB collision detection, and dynamic lighting system. The architecture is designed to be extensible with an ECS (Entity Component System) and supports multithreading for terrain generation."
			},
			{
				"id": 4,
				"title": "Wazuh AI Assistant - Cybersecurity API",
				"description": "On-premise REST API integrating an LLM to synthesize Wazuh reports. Containerized solution meeting C3 security constraints with multi-model support.",
				"longDescription": "Developed during my internship in Romania at Thales, this project consists of a secure REST API enabling automatic analysis and synthesis of Wazuh security reports via a locally hosted LLM. The solution, fully containerized with Docker, supports multiple models (TinyLlama, Qwen, Mistral 7B) and integrates Redis cache for performance optimization. The architecture includes PostgreSQL for account management, Qdrant for vector search in CVEs, and Nginx for TLS termination. Compliant with C3 security requirements."
			},
			{
				"id": 5,
				"title": "Personal Portfolio",
				"description": "Modern portfolio website developed with Vue 3 and TypeScript. Responsive design, smooth animations, multilingual support, and dark mode.",
				"longDescription": "Personal portfolio developed with the latest web technologies. Uses Vue 3 with Composition API, TypeScript for strong typing, and Pinia for state management. The design is fully responsive with Tailwind CSS, includes custom animations, a light/dark theme system, and multilingual support (i18n) for 6 languages. Optimized for performance with lazy loading and code splitting."
			}
		]
	},
	"contact": {
		"title": "Contact Me",
		"subtitle": "Feel free to reach out to me for any questions, collaboration opportunities, or just to say hello!",
		"getInTouchTitle": "Get In Touch",
		"getInTouch": "I'll get back to you as soon as possible.",
		"emailLabel": "Email",
		"locationLabel": "Location",
		"locationValue": "Paris, France",
		"connectWithMe": "Connect With Me",
		"sendMessageTitle": "Send Me a Message",
		"name": "Name",
		"namePlaceholder": "Your name",
		"email": "Email",
		"emailPlaceholder": "your.email@example.com",
		"message": "Message",
		"messagePlaceholder": "Your message...",
		"send": "Send Message",
		"sending": "Sending...",
		"messageSent": "Message sent successfully!"
	},
	"footer": {
		"allRightsReserved": "All rights reserved."
	},
	"research": {
		"title": "Publications & Research",
		"description": "My research work and academic publications in optimization, CI/CD, and cybersecurity.",
		"searchPlaceholder": "Search publications...",
		"sortByDate": "Sort by date",
		"sortByCitations": "Sort by citations",
		"allTopics": "All topics",
		"featured": "Featured",
		"citations": "citations",
		"downloadPdf": "Download PDF",
		"noResults": "No publications found."
	}
}
