{
	"nav": {
		"home": "Home",
		"about": "About",
		"projects": "Projects",
		"research": "Research",
		"contact": "Contact"
	},
	"home": {
		"title": "Welcome to My Portfolio",
		"subtitle": "Mathematics and Computer Science Engineer",
		"passion": "Specialized in mathematical optimization, artificial intelligence and innovative solution development.",
		"terminal": {
			"commandWhoAmI": "whoami",
			"developerInfo": "Denis Chaput • Mathematics and Computer Science Engineer • Thales",
			"commandSkills": "skills --list"
		},
		"viewProjects": "View Projects",
		"contactMe": "Contact Me",
		"featuredProjects": "Featured Projects"
	},
	"about": {
		"title": "About Me",
		"description": "Graduate engineer passionate about mathematics, computer science and solving complex challenges.",
		"experience": "Professional Experience",
		"personalInfo": "Description",
		"profile": "Profile",
		"currentPosition": "Current Position",
		"location": "Location",
		"education": "Education",
		"technologies": "Technologies",
		"programmingLanguages": "Programming Languages",
		"skillLevels": {
			"expert": "Expert",
			"advanced": "Advanced",
			"intermediate": "Intermediate",
			"beginner": "Beginner"
		},
		"educationItems": [
			{
				"institution": "Polytech Paris-Saclay",
				"degree": "Engineering Degree - Computer Science and Mathematical Engineering",
				"period": "2022 - 2025",
				"description": "Computer and Mathematical Engineering. Work-study program at Thales."
			},
			{
				"institution": "Independent Study",
				"degree": "Applied Mathematics & Artificial Intelligence",
				"period": "2023 - 2025",
				"description": "In-depth self-taught training in applied mathematics, machine learning and artificial intelligence."
			}
		],
		"experienceItems": [
			{
				"company": "Thales Land & Air Systems",
				"role": "CI/CD Developer Engineer Apprentice",
				"period": "Sept 2023 - Aug 2025",
				"description": "Design and implementation of a new modular software production chain replacing the legacy solution to manage multi-million line projects."
			},
			{
				"company": "Thales Romania",
				"role": "Cybersecurity Developer Intern",
				"period": "June 2025 - Aug 2025",
				"description": "Development of an on-premise REST API integrating an LLM for automatic analysis of security reports, compliant with C3 requirements."
			}
		]
	},
	"projects": {
		"title": "My Projects",
		"description": "Explore my professional and personal projects",
		"searchPlaceholder": "Search projects...",
		"noResults": "No projects found matching your criteria.",
		"clearFilters": "Clear Filters",
		"viewProject": "View Project",
		"viewLiveDemo": "View Live Demo",
		"viewSource": "View Source",
		"status": {
			"active": "Active",
			"completed": "Completed",
			"in-progress": "In Progress",
			"archived": "Archived",
			"maintenance": "Maintenance"
		},
		"items": [
			{
				"id": 1,
				"title": "Modular CI/CD Production Chain",
				"description": "New modular software production chain for industrial environment. Python architecture enabling parallel compilation and incremental production.",
				"longDescription": "During my apprenticeship at Thales, I designed and implemented a modular CI/CD production chain replacing the legacy solution. This new Python architecture enables build parallelization, optimized dependency management per OS/architecture, and improves autonomy from continuous integration tools. The system handles large-scale projects with complete traceability and multi-platform support. Results: significant improvement in compilation times, with gains ranging from 20% to 80% depending on execution mode."
			},
			{
				"id": 2,
				"title": "RiemannOpt - Riemannian Optimization Library",
				"description": "High-performance Rust library for optimization on Riemannian manifolds. Implementation of geodesic gradient descent and retraction algorithms for machine learning.",
				"longDescription": "RiemannOpt is an optimization library developed in Rust, specialized in optimization methods on Riemannian manifolds. It implements state-of-the-art algorithms like Riemannian gradient descent, retraction methods, and parallel transport. The library offers exceptional performance thanks to Rust and finds applications in machine learning, computer vision, and signal processing. It includes optimizations for Grassmann and Stiefel manifolds, and SPD matrices."
			},
			{
				"id": 3,
				"title": "MinePP - Minecraft Clone in C++",
				"description": "Voxel game engine developed from scratch in modern C++ with OpenGL. Procedural terrain generation, optimized chunk system, and custom physics engine.",
				"longDescription": "MinePP is a Minecraft clone developed entirely in modern C++ (C++20), using OpenGL for 3D rendering. The project implements a chunk system with frustum culling, procedural terrain generation via Perlin noise, custom physics engine with AABB collision detection, and dynamic lighting system. The architecture is designed to be extensible with an ECS (Entity Component System) and supports multithreading for terrain generation."
			},
			{
				"id": 4,
				"title": "Wazuh AI Assistant - Cybersecurity API",
				"description": "On-premise REST API integrating an LLM to synthesize Wazuh reports. Containerized solution meeting C3 security constraints with multi-model support.",
				"longDescription": "Developed during my internship in Romania at Thales, this project consists of a secure REST API enabling automatic analysis and synthesis of Wazuh security reports via a locally hosted LLM. The solution, fully containerized with Docker, supports multiple models (TinyLlama, Qwen, Mistral 7B) and integrates Redis cache for performance optimization. The architecture includes PostgreSQL for account management, Qdrant for vector search in CVEs, and Nginx for TLS termination. Compliant with C3 security requirements."
			},
			{
				"id": 5,
				"title": "Personal Portfolio",
				"description": "Modern portfolio website developed with Vue 3 and TypeScript. Responsive design, smooth animations, and multilingual support.",
				"longDescription": "Personal portfolio developed with the latest web technologies. Uses Vue 3 with Composition API, TypeScript for strong typing, and Pinia for state management. The design is fully responsive with Tailwind CSS, includes custom animations and multilingual support (i18n) for 6 languages. Optimized for performance with lazy loading and code splitting."
			}
		]
	},
	"contact": {
		"title": "Contact Me",
		"subtitle": "Feel free to reach out to me for any questions, collaboration opportunities, or just to say hello!",
		"getInTouchTitle": "Get In Touch",
		"getInTouch": "I'll get back to you as soon as possible.",
		"emailLabel": "Email",
		"locationLabel": "Location",
		"locationValue": "Paris, France",
		"connectWithMe": "Connect With Me",
		"sendMessageTitle": "Send Me a Message",
		"name": "Name",
		"namePlaceholder": "Your name",
		"email": "Email",
		"emailPlaceholder": "your.email{'@'}example.com",
		"message": "Message",
		"messagePlaceholder": "Your message...",
		"send": "Send Message",
		"sending": "Sending...",
		"messageSent": "Message sent successfully!"
	},
	"footer": {
		"allRightsReserved": "All rights reserved."
	},
	"research": {
		"title": "Publications & Research",
		"description": "My independent research work (and future academic publications).",
		"searchPlaceholder": "Search publications...",
		"sortByDate": "Sort by date",
		"sortByCitations": "Sort by citations",
		"allTopics": "All topics",
		"featured": "Featured",
		"citations": "citations",
		"downloadPdf": "Download PDF",
		"noResults": "No publications found.",
		"notAvailableTitle": "Publications Coming Soon",
		"notAvailableMessage": "Research papers are not yet available. They will be published soon.",
		"papers": []
	}
}
