{
	"nav": {
		"home": "Accueil",
		"about": "À propos",
		"projects": "Projets",
		"research": "Recherche",
		"contact": "Contact"
	},
	"home": {
		"title": "Bienvenue sur Mon Portfolio",
		"subtitle": "Ingénieur Mathématique et Informatique",
		"terminal": {
			"commandWhoAmI": "whoami",
			"developerInfo": "Denis Chaput • Ingénieur Mathématique et Informatique • Thales",
			"commandSkills": "skills --list"
		},
		"viewProjects": "Voir les Projets",
		"contactMe": "Contactez-moi",
		"featuredProjects": "Projets en Vedette"
	},
	"about": {
		"title": "À propos de moi",
		"description": "Ingénieur en alternance chez Thales, spécialisé dans les systèmes CI/CD et l'optimisation des chaînes de production logicielle. Passionné par les technologies de pointe, l'optimisation de performances et les défis techniques complexes.",
		"experience": "Expérience",
		"education": "Formation",
		"technologies": "Technologies",
		"topSkills": "Compétences Principales"
	},
	"projects": {
		"title": "Mes Projets",
		"description": "Découvrez mes projets professionnels et personnels",
		"searchPlaceholder": "Rechercher des projets...",
		"noResults": "Aucun projet ne correspond à vos critères.",
		"clearFilters": "Effacer les filtres",
		"viewProject": "Voir le projet",
		"viewLiveDemo": "Voir la démo",
		"viewSource": "Voir le code source",
		"items": [
			{
				"id": 1,
				"title": "ProChain - Chaîne de Production CI/CD",
				"description": "Nouvelle chaîne de production logicielle modulaire pour Thales, remplaçant GCONF_TOOLS. Architecture Python permettant compilation parallèle, production incrémentale et indépendance vis-à-vis de Jenkins.",
				"longDescription": "Durant mon alternance chez Thales, j'ai conçu et implémenté ProChain, une chaîne de production CI/CD modulaire remplaçant l'ancienne solution GCONF_TOOLS. Cette nouvelle architecture en Python permet la parallélisation des builds, la gestion fine des dépendances par OS/architecture, et réduit drastiquement la dépendance à Jenkins. Le système gère des projets de plusieurs millions de lignes de code avec traçabilité ITAR et support multi-plateformes (Linux, Windows). Résultats : réduction de 20% du temps de compilation en mode full, et jusqu'à 80% en mode delta."
			},
			{
				"id": 2,
				"title": "RiemannOpt - Librairie d'Optimisation Riemannienne",
				"description": "Librairie Rust haute performance pour l'optimisation sur variétés riemanniennes. Implémentation d'algorithmes de descente de gradient géodésique et rétraction pour l'apprentissage automatique.",
				"longDescription": "RiemannOpt est une librairie d'optimisation développée en Rust, spécialisée dans les méthodes d'optimisation sur variétés riemanniennes. Elle implémente des algorithmes de pointe comme la descente de gradient riemannien, les méthodes de rétraction et le transport parallèle. La librairie offre des performances exceptionnelles grâce à Rust et trouve des applications en apprentissage automatique, vision par ordinateur et traitement du signal. Elle inclut des optimisations pour les variétés de Grassmann, Stiefel et les matrices SPD."
			},
			{
				"id": 3,
				"title": "MinePP - Clone Minecraft en C++",
				"description": "Moteur de jeu voxel développé from scratch en C++ moderne avec OpenGL. Génération procédurale de terrain, système de chunks optimisé et moteur physique custom.",
				"longDescription": "MinePP est un clone de Minecraft développé entièrement en C++ moderne (C++20), utilisant OpenGL pour le rendu 3D. Le projet implémente un système de chunks avec culling frustum, génération procédurale de terrain via bruit de Perlin, moteur physique custom avec détection de collision AABB, et système d'éclairage dynamique. L'architecture est conçue pour être extensible avec un système ECS (Entity Component System) et supporte le multithreading pour la génération de terrain."
			},
			{
				"id": 4,
				"title": "Wazuh AI Assistant - API Cybersécurité",
				"description": "API REST on-premise intégrant un LLM pour synthétiser les rapports Wazuh. Solution conteneurisée respectant les contraintes de sécurité C3 avec support multi-modèles.",
				"longDescription": "Développé durant mon stage en Roumanie chez Thales, ce projet consiste en une API REST sécurisée permettant l'analyse et la synthèse automatique des rapports de sécurité Wazuh via un LLM hébergé localement. La solution, entièrement conteneurisée avec Docker, supporte plusieurs modèles (TinyLlama, Qwen, Mistral 7B) et intègre un cache Redis pour optimiser les performances. L'architecture inclut PostgreSQL pour la gestion des comptes, Qdrant pour la recherche vectorielle dans les CVE, et Nginx pour la terminaison TLS. Conforme aux exigences de sécurité C3."
			},
			{
				"id": 5,
				"title": "Portfolio Personnel",
				"description": "Site portfolio moderne développé avec Vue 3 et TypeScript. Design responsive, animations fluides, support multilingue et mode sombre.",
				"longDescription": "Portfolio personnel développé avec les dernières technologies web. Utilise Vue 3 avec Composition API, TypeScript pour le typage fort, et Pinia pour la gestion d'état. Le design est entièrement responsive avec Tailwind CSS, inclut des animations personnalisées, un système de thème clair/sombre, et support multilingue (i18n) pour 6 langues. Optimisé pour les performances avec lazy loading et code splitting."
			},
			{
				"id": 6,
				"title": "Module SBOM/CVE Generator",
				"description": "Outil d'analyse de dépendances et génération de SBOM pour la détection de vulnérabilités. Parse les fichiers CMake et vcxproj pour identifier les dépendances réelles.",
				"longDescription": "Module développé chez Thales pour générer automatiquement des Software Bill of Materials (SBOM) et détecter les CVE dans les projets C++/Java. L'outil analyse les fichiers de build (Makefiles, vcxproj) pour extraire les dépendances réelles plutôt que déclarées, garantissant une précision maximale. Il produit des fichiers JSON enrichis servant à la génération de SBOM au format standard, permettant l'intégration avec les scanners de vulnérabilités. Solution critique pour la conformité et la sécurité de la supply chain logicielle."
			}
		]
	},
	"contact": {
		"title": "Me Contacter",
		"subtitle": "N'hésitez pas à me contacter pour toute question, opportunité de collaboration, ou simplement pour dire bonjour !",
		"getInTouch": "Je vous répondrai dès que possible.",
		"name": "Nom",
		"email": "Email",
		"message": "Message",
		"send": "Envoyer le message",
		"messageSent": "Message envoyé avec succès !"
	},
	"footer": {
		"allRightsReserved": "Tous droits réservés."
	},
	"research": {
		"title": "Publications & Recherche",
		"description": "Mes travaux de recherche et publications académiques en optimisation, CI/CD, et cybersécurité.",
		"searchPlaceholder": "Rechercher des publications...",
		"sortByDate": "Trier par date",
		"sortByCitations": "Trier par citations",
		"allTopics": "Tous les sujets",
		"featured": "En vedette",
		"citations": "citations",
		"downloadPdf": "Télécharger PDF",
		"noResults": "Aucune publication trouvée."
	}
}