{
	"nav": {
		"home": "Início",
		"about": "Sobre",
		"projects": "Projetos",
		"research": "Pesquisa",
		"contact": "Contato"
	},
	"home": {
		"title": "Bem-vindo ao Meu Portfólio",
		"subtitle": "Engenheiro de Matemática e Informática",
		"passion": "Especializado em otimização matemática, inteligência artificial e desenvolvimento de soluções inovadoras.",
		"terminal": {
			"commandWhoAmI": "whoami",
			"developerInfo": "Denis Chaput • Engenheiro de Matemática e Informática • Thales",
			"commandSkills": "skills --list"
		},
		"viewProjects": "Ver Projetos",
		"contactMe": "Entre em Contato",
		"featuredProjects": "Projetos em Destaque"
	},
	"about": {
		"title": "Sobre mim",
		"description": "Engenheiro graduado apaixonado por matemática, ciência da computação e resolução de desafios complexos.",
		"experience": "Experiência profissional",
		"personalInfo": "Descrição",
		"profile": "Perfil",
		"currentPosition": "Posição Atual",
		"location": "Localização",
		"education": "Educação",
		"technologies": "Tecnologias",
		"programmingLanguages": "Linguagens de programação",
		"skillLevels": {
			"expert": "Especialista",
			"advanced": "Avançado",
			"intermediate": "Intermediário",
			"beginner": "Noções"
		},
		"educationItems": [
			{
				"institution": "Polytech Paris-Saclay",
				"degree": "Diploma de Engenharia - Ciência da Computação e Engenharia Matemática",
				"period": "2022 - 2025",
				"description": "Engenharia da Computação e Matemática. Programa de estudos e trabalho na Thales."
			},
			{
				"institution": "Estudo Independente",
				"degree": "Matemática Aplicada & Inteligência Artificial",
				"period": "2023 - 2025",
				"description": "Formação autodidacta aprofundada em matemática aplicada, aprendizado de máquina e inteligência artificial."
			}
		],
		"experienceItems": [
			{
				"company": "Thales Land & Air Systems",
				"role": "Aprendiz Engenheiro Desenvolvedor CI/CD",
				"period": "Set 2023 - Ago 2025",
				"description": "Projeto e implementação de uma nova cadeia de produção de software modular substituindo a solução legada para gerenciar projetos multi-milhões de linhas."
			},
			{
				"company": "Thales Romania",
				"role": "Estagiário Desenvolvedor de Cibersegurança",
				"period": "Junho 2025 - Ago 2025",
				"description": "Desenvolvimento de uma API REST local integrando um LLM para análise automática de relatórios de segurança, em conformidade com os requisitos C3."
			}
		]
	},
	"projects": {
		"title": "Meus Projetos",
		"description": "Explore meus projetos profissionais e pessoais",
		"searchPlaceholder": "Buscar projetos...",
		"noResults": "Nenhum projeto encontrado com seus critérios.",
		"clearFilters": "Limpar Filtros",
		"viewProject": "Ver Projeto",
		"viewLiveDemo": "Ver Demo",
		"viewSource": "Ver Código Fonte",
		"status": {
			"active": "Ativo",
			"completed": "Concluído",
			"in-progress": "Em Progresso",
			"archived": "Arquivado",
			"maintenance": "Manutenção"
		},
		"items": [
			{
				"id": 1,
				"title": "Cadeia de Produção CI/CD Modular",
				"description": "Nova cadeia de produção de software modular substituindo a solução legada. Arquitetura Python permitindo compilação paralela, produção incremental e melhor autonomia das ferramentas de CI.",
				"longDescription": "Durante meu estágio na Thales, projetei e implementei uma cadeia de produção CI/CD modular que substitui a solução legada. Esta nova arquitetura Python permite paralelização de builds, gerenciamento otimizado de dependências por SO/arquitetura e melhora a autonomia das ferramentas de integração contínua. O sistema gerencia projetos de grande escala com rastreabilidade completa e suporte multiplataforma. Resultados: melhoria significativa nos tempos de compilação, com ganhos de 20% a 80% dependendo do modo de execução."
			},
			{
				"id": 2,
				"title": "RiemannOpt - Biblioteca de Otimização Riemanniana",
				"description": "Biblioteca Rust de alta performance para otimização em variedades riemannianas. Implementação de algoritmos de descida de gradiente geodésica e retração para aprendizado de máquina.",
				"longDescription": "RiemannOpt é uma biblioteca de otimização desenvolvida em Rust, especializada em métodos de otimização em variedades riemannianas. Implementa algoritmos de ponta como descida de gradiente riemanniana, métodos de retração e transporte paralelo. A biblioteca oferece performance excepcional graças ao Rust e encontra aplicações em aprendizado de máquina, visão computacional e processamento de sinais. Inclui otimizações para variedades de Grassmann, Stiefel e matrizes SPD."
			},
			{
				"id": 3,
				"title": "MinePP - Clone do Minecraft em C++",
				"description": "Motor de jogo voxel desenvolvido do zero em C++ moderno com OpenGL. Geração procedural de terreno, sistema de chunks otimizado e motor físico personalizado.",
				"longDescription": "MinePP é um clone do Minecraft desenvolvido inteiramente em C++ moderno (C++20), usando OpenGL para renderização 3D. O projeto implementa um sistema de chunks com frustum culling, geração procedural de terreno via ruído de Perlin, motor físico personalizado com detecção de colisão AABB e sistema de iluminação dinâmica. A arquitetura é projetada para ser extensível com um sistema ECS (Entity Component System) e suporta multithreading para geração de terreno."
			},
			{
				"id": 4,
				"title": "Wazuh AI Assistant - API de Cibersegurança",
				"description": "API REST on-premise integrando um LLM para sintetizar relatórios do Wazuh. Solução containerizada respeitando restrições de segurança C3 com suporte multi-modelos.",
				"longDescription": "Desenvolvido durante meu estágio na Romênia na Thales, este projeto consiste em uma API REST segura permitindo análise e síntese automática de relatórios de segurança do Wazuh via LLM hospedado localmente. A solução, totalmente containerizada com Docker, suporta múltiplos modelos (TinyLlama, Qwen, Mistral 7B) e integra cache Redis para otimização de performance. A arquitetura inclui PostgreSQL para gerenciamento de contas, Qdrant para busca vetorial em CVEs e Nginx para terminação TLS. Conforme com requisitos de segurança C3."
			},
			{
				"id": 5,
				"title": "Portfólio Pessoal",
				"description": "Site portfólio moderno desenvolvido com Vue 3 e TypeScript. Design responsivo, animações fluidas e suporte multilíngue.",
				"longDescription": "Portfólio pessoal desenvolvido com as mais recentes tecnologias web. Usa Vue 3 com Composition API, TypeScript para tipagem forte e Pinia para gerenciamento de estado. O design é totalmente responsivo com Tailwind CSS, inclui animações personalizadas e suporte multilíngue (i18n) para 6 idiomas. Otimizado para performance com lazy loading e code splitting."
			}
		]
	},
	"contact": {
		"title": "Entre em Contato",
		"subtitle": "Sinta-se à vontade para entrar em contato comigo para qualquer pergunta, oportunidades de colaboração ou apenas para dizer olá!",
		"getInTouchTitle": "Entre em Contato",
		"getInTouch": "Responderei o mais rápido possível.",
		"emailLabel": "Email",
		"locationLabel": "Localização",
		"locationValue": "Paris, França",
		"connectWithMe": "Conecte-se Comigo",
		"sendMessageTitle": "Envie-me uma Mensagem",
		"name": "Nome",
		"namePlaceholder": "Seu nome",
		"email": "E-mail",
		"emailPlaceholder": "seu.email{'@'}exemplo.com",
		"message": "Mensagem",
		"messagePlaceholder": "Sua mensagem...",
		"send": "Enviar Mensagem",
		"sending": "Enviando...",
		"messageSent": "Mensagem enviada com sucesso!"
	},
	"footer": {
		"allRightsReserved": "Todos os direitos reservados."
	},
	"research": {
		"title": "Publicações e Pesquisa",
		"description": "Meu trabalho de pesquisa independente (e futuras publicações acadêmicas).",
		"searchPlaceholder": "Buscar publicações...",
		"sortByDate": "Ordenar por data",
		"sortByCitations": "Ordenar por citações",
		"allTopics": "Todos os tópicos",
		"featured": "Destaque",
		"citations": "citações",
		"downloadPdf": "Baixar PDF",
		"noResults": "Nenhuma publicação encontrada.",
		"notAvailableTitle": "Publicações em Breve",
		"notAvailableMessage": "Os artigos de pesquisa ainda não estão disponíveis. Serão publicados em breve.",
		"papers": []
	}
}
